// Даны два числа a, b, такие что a < b. Вывести на экран сколько раз число a поместиться в числе b.

int a = 8,
    b = 31;

Console.WriteLine(b / a);
